soburi/openthread_nrf52_arduino/libraries/Bluefruit52Lib/src/bluefruit.cpp
  opt.common_opt.conn_evt_ext.enable = 1; // enable Data Length Extension
  VERIFY_STATUS( sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT, &opt), false );

  // Init Peripheral role
  VERIFY( Periph.begin() );

  Security.begin();

  // Default device name
  ble_gap_conn_sec_mode_t sec_mode = BLE_SECMODE_OPEN;
  VERIFY_STATUS(sd_ble_gap_device_name_set(&sec_mode, (uint8_t const *) CFG_DEFAULT_NAME, strlen(CFG_DEFAULT_NAME)), false);

  // Init Central role
  if (_central_count)  Central.begin();

  NRF_SDH_BLE_OBSERVER(m_ble_observer, NRF_SDH_BLE_STACK_OBSERVER_PRIO, ble_evt_handler, NULL);
  NRF_SDH_SOC_OBSERVER(m_soc_observer, NRF_SDH_SOC_STACK_OBSERVER_PRIO, AdafruitBluefruit::soc_evt_handler, NULL);

  // Create Timer for led advertising blinky
  _led_blink_th = xTimerCreate(NULL, ms2tick(CFG_ADV_BLINKY_INTERVAL/2), true, NULL, bluefruit_blinky_cb);

  // Initialize bonding
  bond_init();

  return true;
}

/*------------------------------------------------------------------*/
/* General Functions
 *------------------------------------------------------------------*/
ble_gap_addr_t AdafruitBluefruit::getAddr (void)
{
  ble_gap_addr_t gap_addr;
  sd_ble_gap_addr_get(&gap_addr);
  return gap_addr;
}

/**
 * Get current Mac address and its type
 * @param mac address
 * @return Address type e.g BLE_GAP_ADDR_TYPE_RANDOM_STATIC
 */
uint8_t AdafruitBluefruit::getAddr (uint8_t mac[6])
{
  ble_gap_addr_t gap_addr;
  sd_ble_gap_addr_get(&gap_addr);

  memcpy(mac, gap_addr.addr, 6);
  return gap_addr.addr_type;
}

bool AdafruitBluefruit::setAddr (ble_gap_addr_t* gap_addr)
{
  VERIFY_STATUS( sd_ble_gap_addr_set(gap_addr), false );
  return true;
}

void AdafruitBluefruit::setName (char const * str)
{
  ble_gap_conn_sec_mode_t sec_mode = BLE_SECMODE_OPEN;
  sd_ble_gap_device_name_set(&sec_mode, (uint8_t const *) str, strlen(str));
}

uint8_t AdafruitBluefruit::getName(char* name, uint16_t bufsize)
{
  VERIFY_STATUS( sd_ble_gap_device_name_get((uint8_t*) name, &bufsize), 0);
  return bufsize;
}


static inline bool is_tx_power_valid(int8_t power)
{
#if defined(NRF52832_XXAA)
  int8_t const accepted[] = { -40, -20, -16, -12, -8, -4, 0, 3, 4 };
#elif defined( NRF52840_XXAA)
  int8_t const accepted[] = { -40, -20, -16, -12, -8, -4, 0, 2, 3, 4, 5, 6, 7, 8 };
#endif

  for (uint32_t i=0; i<sizeof(accepted); i++)
  {
    if (accepted[i] == power) return true;
  }

  return false;
}

bool AdafruitBluefruit::setTxPower(int8_t power)
{
  VERIFY(is_tx_power_valid(power));
  _tx_power = power;
  return true;
}

int8_t AdafruitBluefruit::getTxPower(void)
{
  return _tx_power;
}

void AdafruitBluefruit::autoConnLed(bool enabled)
{
  _led_conn = enabled;
}

void AdafruitBluefruit::setConnLedInterval(uint32_t ms)
{
  BaseType_t active = xTimerIsTimerActive(_led_blink_th);
  xTimerChangePeriod(_led_blink_th, ms2tick(ms), 0);

  // Change period of inactive timer will also start it !!
  if ( !active ) xTimerStop(_led_blink_th, 0);
}

bool AdafruitBluefruit::setAppearance(uint16_t appear)
{
  return ERROR_NONE == sd_ble_gap_appearance_set(appear);
}

uint16_t AdafruitBluefruit::getAppearance(void)
{
  uint16_t appear = 0;
  (void) sd_ble_gap_appearance_get(&appear);
  return appear;
}

/*------------------------------------------------------------------*/
/* GAP, Connections and Bonding
 *------------------------------------------------------------------*/
uint8_t AdafruitBluefruit::connected(void)
{
  uint8_t count = 0;
  for (uint16_t c=0; c<BLE_MAX_CONNECTION; c++)
  {
    if ( this->connected(c) ) count++;
  }

  return count;
}

bool AdafruitBluefruit::connected(uint16_t conn_hdl)
{
  BLEConnection* conn = this->Connection(conn_hdl);
  return conn && conn->connected();
}

bool AdafruitBluefruit::disconnect(uint16_t conn_hdl)
{
  BLEConnection* conn = this->Connection(conn_hdl);

  // disconnect if connected
  if ( conn && conn->connected() )
  {
    return conn->disconnect();
  }

  return true; // not connected still return true
}

void AdafruitBluefruit::setEventCallback (event_cb_t fp)
{
  _event_cb = fp;
}

uint16_t AdafruitBluefruit::connHandle(void)
{
  return _conn_hdl;
}

uint16_t AdafruitBluefruit::getMaxMtu(uint8_t role)
{
  return (role == BLE_GAP_ROLE_PERIPH) ? _sd_cfg.prph.mtu_max : _sd_cfg.central.mtu_max;
}

BLEConnection* AdafruitBluefruit::Connection(uint16_t conn_hdl)
{
  return (conn_hdl < BLE_MAX_CONNECTION) ? _connection[conn_hdl] : NULL;
}

void AdafruitBluefruit::setRssiCallback(rssi_cb_t fp)
{
  _rssi_cb = fp;
}


COMMENT_OUT (
bool AdafruitBluefruit::setPIN(const char* pin)
{
  VERIFY ( strlen(pin) == BLE_GAP_PASSKEY_LEN );

  _auth_type = BLE_GAP_AUTH_KEY_TYPE_PASSKEY;
  memcpy(_pin, pin, BLE_GAP_PASSKEY_LEN);

// Config Static Passkey
//  ble_opt_t opt
//	uint8_t passkey[] = STATIC_PASSKEY;
//	m_static_pin_option.gap.passkey.p_passkey = passkey;
//err_code = sd_ble_opt_set(BLE_GAP_OPT_PASSKEY, &m_static_pin_option);

  return true;
}
)

void AdafruitBluefruit::soc_evt_handler(uint32_t soc_evt, void * p_context)
{
  switch (soc_evt)
  {
    // Flash
    case NRF_EVT_FLASH_OPERATION_SUCCESS:
    case NRF_EVT_FLASH_OPERATION_ERROR:
      LOG_LV1("SOC", "NRF_EVT_FLASH_OPERATION_%s", soc_evt == NRF_EVT_FLASH_OPERATION_SUCCESS ? "SUCCESS" : "ERROR");
      if ( flash_nrf5x_event_cb ) flash_nrf5x_event_cb(soc_evt);
    break;

    default: break;
  }
}

/*------------------------------------------------------------------*/
/* BLE Event handler
 *------------------------------------------------------------------*/
void AdafruitBluefruit::ble_evt_handler(ble_evt_t const * ev_buf, void * p_context)
{
  (void) p_context;
  Bluefruit._ble_handler( const_cast<ble_evt_t*>(ev_buf) );
}

/**
 * BLE event handler
 * @param evt event
 */
void AdafruitBluefruit::_ble_handler(ble_evt_t* evt)
{
  // conn handle has fixed offset for all events
  uint16_t const conn_hdl = evt->evt.common_evt.conn_handle;
  BLEConnection* conn = this->Connection(conn_hdl);

  LOG_LV2("BLE", "%s : Conn Handle = %d", dbg_ble_event_str(evt->header.evt_id), conn_hdl);

