soburi/openthread_nrf52_arduino/libraries/Bluefruit52Lib/src/bluefruit.cpp
    logger.print("  - ");
    logger.printf(title_fmt, "HVN Queue Size");
    logger.println(_sd_cfg.prph.hvn_qsize);

    logger.print("  - ");
    logger.printf(title_fmt, "WrCmd Queue Size");
    logger.println(_sd_cfg.prph.wrcmd_qsize);
  }

  if ( _central_count )
  {
    logger.println("Central Connect Setting");

    logger.print("  - ");
    logger.printf(title_fmt, "Max MTU");
    logger.println(_sd_cfg.central.mtu_max);

    logger.print("  - ");
    logger.printf(title_fmt, "Event Length");
    logger.println(_sd_cfg.central.event_len);

    logger.print("  - ");
    logger.printf(title_fmt, "HVN Queue Size");
    logger.println(_sd_cfg.central.hvn_qsize);

    logger.print("  - ");
    logger.printf(title_fmt, "WrCmd Queue Size");
    logger.println(_sd_cfg.central.wrcmd_qsize);
  }

  /*------------- Settings -------------*/
  logger.println("\n--------- BLE Settings ---------");
  // Name
  logger.printf(title_fmt, "Name");
  {
    char name[32];
    memclr(name, sizeof(name));
    getName(name, sizeof(name));
    logger.printf(name);
  }
  logger.println();

  // Max Connections
  logger.printf(title_fmt, "Max Connections");
  logger.printf("Peripheral = %d, ", _prph_count);
  logger.printf("Central = %d ", _central_count);
  logger.println();

  // Address
  logger.printf(title_fmt, "Address");
  {
    char const * type_str[] = { "Public", "Static", "Private Resolvable", "Private Non Resolvable" };
    ble_gap_addr_t gap_addr = this->getAddr();

    // MAC is in little endian --> print reverse
    logger.printBufferReverse(gap_addr.addr, 6, ':');
    logger.printf(" (%s)", type_str[gap_addr.addr_type]);
  }
  logger.println();

  // Tx Power
  logger.printf(title_fmt, "TX Power");
  logger.printf("%d dBm", _tx_power);
  logger.println();

  Periph.printInfo();

  /*------------- List the paired devices -------------*/
  if ( _prph_count )
  {
    logger.printf(title_fmt, "Peripheral Paired Devices");
    logger.println();
    bond_print_list(BLE_GAP_ROLE_PERIPH);
  }

  if ( _central_count )
  {
    logger.printf(title_fmt, "Central Paired Devices");
    logger.println();
    bond_print_list(BLE_GAP_ROLE_CENTRAL);
  }

  logger.println();
}
